cf_billing/InformationRegisters/энргПодписиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПодписиСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПодписиСотрудников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет подписи сотрудников.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПодписиСотрудников(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПодписиСотрудников());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "Организация, Район, ОтчетнаяФорма, Сотрудник";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор, "энргПодписиСотрудниковСрезПоследних", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПодписиСотрудников()
	
	Текст  		=
	"ВЫБРАТЬ
	|	энргПодписиСотрудниковСрезПоследних.Организация КАК Организация,
	|	энргПодписиСотрудниковСрезПоследних.Район КАК Район,
	|	энргПодписиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	энргПодписиСотрудниковСрезПоследних.Подпись КАК Подпись
	|ИЗ
	|	РегистрСведений.энргПодписиСотрудников.СрезПоследних(&Период) КАК энргПодписиСотрудниковСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
